<?php
$cities=[
  [
    "id"=> 3670,
    "name_ar"=> "أم الساهك"
  ],
  [
      "id"=> 15,
    "name_ar"=> "ابها"
  ],
  [
      "id"=> 3525,
    "name_ar"=> "ابو عريش"
  ],
  [
   "id"=> 3652,
    "name_ar"=> "احد المسارحة"
  ],
  [
      "id"=> 65,
    "name_ar"=> "احد رفيده"
  ],
  [
      "id"=> 3705,
    "name_ar"=> "اضم"
  ],
  [
      "id"=> 3730,
    "name_ar"=> "الأفلاج"
  ],
  [
      "id"=> 3667,
    "name_ar"=> "الاحساء "
  ],
  [
      "id"=> 3721,
    "name_ar"=> "الارطاوية"
  ],
  [
      "id"=> 3686,
    "name_ar"=> "الاسياح"
  ],
  [
      "id"=> 1542,
    "name_ar"=> "الباحة"
  ],
  [
      "id"=> 3731,
    "name_ar"=> "البجادية"
  ],
  [
      "id"=> 2481,
    "name_ar"=> "البدائع"
  ],
  [
      "id"=> 3727,
    "name_ar"=> "البدع"
  ],
  [
      "id"=> 2630,
    "name_ar"=> "البكيرية"
  ],
  [
      "id"=> 113,
    "name_ar"=> "الجبيل"
  ],
  [
      "id"=> 3669,
    "name_ar"=> "الجبيل البلد"
  ],
  [
      "id"=> 3668,
    "name_ar"=> "الجبيل الصناعية"
  ],
  [
      "id"=> 1257,
    "name_ar"=> "الجموم"
  ],
  [
      "id"=> 3735,
    "name_ar"=> "الجوف"
  ],
  [
      "id"=> 3722,
    "name_ar"=> "الحائط"
  ],
  [
      "id"=> 3158,
    "name_ar"=> "الحريق"
  ],
  [
      "id"=> 3694,
    "name_ar"=> "الحناكية"
  ],
  [
      "id"=> 31,
    "name_ar"=> "الخبر"
  ],
  [
      "id"=> 3674,
    "name_ar"=> "الخبراء"
  ],
  [
      "id"=> 1061,
    "name_ar"=> "الخرج"
  ],
  [
      "id"=> 3701,
    "name_ar"=> "الخرماء"
  ],
  [
      "id"=> 1248,
    "name_ar"=> "الخرمة"
  ],
  [
      "id"=> 2464,
    "name_ar"=> "الخفجي"
  ],
  [
      "id"=> 3689,
    "name_ar"=> "الداير"
  ],
  [
      "id"=> 3678,
    "name_ar"=> "الدرب"
  ],
  [
      "id"=> 828,
    "name_ar"=> "الدرعية"
  ],
  [
      "id"=> 1073,
    "name_ar"=> "الدلم"
  ],
  [
      "id"=> 13,
    "name_ar"=> "الدمام"
  ],
  [
      "id"=> 669,
    "name_ar"=> "الدوادمي"
  ],
  [
      "id"=> 2421,
    "name_ar"=> "الرس"
  ],
  [
      "id"=> 3724,
    "name_ar"=> "الرويضة"
  ],
  [
      "id"=> 3,
    "name_ar"=> "الرياض"
  ],
  [
      "id"=> 3740,
    "name_ar"=> "الرين"
  ],
  [
      "id"=> 270,
    "name_ar"=> "الزلفي"
  ],
  [
      "id"=> 3719,
    "name_ar"=> "السديره"
  ],
  [
      "id"=> 1361,
    "name_ar"=> "السليل"
  ],
  [
      "id"=> 3671,
    "name_ar"=> "الشقيق"
  ],
  [
      "id"=> 2777,
    "name_ar"=> "الشماسية"
  ],
  [
      "id"=> 3734,
    "name_ar"=> "الشملي"
  ],
  [
      "id"=> 1228,
    "name_ar"=> "الشنان"
  ],
  [
      "id"=> 5,
    "name_ar"=> "الطائف"
  ],
  [
      "id"=> 3738,
    "name_ar"=> "الطوال "
  ],
  [
      "id"=> 227,
    "name_ar"=> "الظهران"
  ],
  [
      "id"=> 3733,
    "name_ar"=> "العرضيات "
  ],
  [
      "id"=> 3711,
    "name_ar"=> "العقيق"
  ],
  [
      "id"=> 3685,
    "name_ar"=> "العلا"
  ],
  [
      "id"=> 3743,
    "name_ar"=> "العمارية"
  ],
  [
      "id"=> 3732,
    "name_ar"=> "العويقلة "
  ],
  [
      "id"=> 3688,
    "name_ar"=> "العيدابي"
  ],
  [
      "id"=> 3739,
    "name_ar"=> "العيص"
  ],
  [
      "id"=> 3741,
    "name_ar"=> "العيينة"
  ],
  [
      "id"=> 306,
    "name_ar"=> "الغاط"
  ],
  [
      "id"=> 2226,
    "name_ar"=> "القريات"
  ],
  [
      "id"=> 67,
    "name_ar"=> "القطيف"
  ],
  [
      "id"=> 1625,
    "name_ar"=> "القنفذة"
  ],
  [
      "id"=> 880,
    "name_ar"=> "القويعية"
  ],
  [
      "id"=> 3684,
    "name_ar"=> "الليث"
  ],
  [
      "id"=> 1294,
    "name_ar"=> "المجاردة"
  ],
  [
      "id"=> 24,
    "name_ar"=> "المجمعة"
  ],
  [
      "id"=> 3706,
    "name_ar"=> "المخواة"
  ],
  [
      "id"=> 14,
    "name_ar"=> "المدينة المنورة"
  ],
  [
      "id"=> 2448,
    "name_ar"=> "المذنب"
  ],
  [
      "id"=> 990,
    "name_ar"=> "المزاحمية"
  ],
  [
      "id"=> 3687,
    "name_ar"=> "المظيلف"
  ],
  [
      "id"=> 3708,
    "name_ar"=> "الموية"
  ],
  [
      "id"=> 3680,
    "name_ar"=> "النبهانية"
  ],
  [
      "id"=> 115,
    "name_ar"=> "النعيرية"
  ],
  [
      "id"=> 3720,
    "name_ar"=> "النماص"
  ],
  [
      "id"=> 12,
    "name_ar"=> "الهفوف"
  ],
  [
      "id"=> 233,
    "name_ar"=> "الوجه"
  ],
  [
      "id"=> 323,
    "name_ar"=> "املج"
  ],
  [
      "id"=> 3713,
    "name_ar"=> "بارق"
  ],
  [
      "id"=> 1053,
    "name_ar"=> "بدر"
  ],
  [
      "id"=> 11,
    "name_ar"=> "بريدة"
  ],
  [
      "id"=> 3696,
    "name_ar"=> "بقعاء"
  ],
  [
      "id"=> 243,
    "name_ar"=> "بقيق"
  ],
  [
      "id"=> 3275,
    "name_ar"=> "بللسمر"
  ],
  [
      "id"=> 3742,
    "name_ar"=> "بنبان"
  ],
  [
      "id"=> 3690,
    "name_ar"=> "بني مالك عسير "
  ],
  [
      "id"=> 3675,
    "name_ar"=> "بيش"
  ],
  [
      "id"=> 1514,
    "name_ar"=> "بيشة"
  ],
  [
      "id"=> 456,
    "name_ar"=> "تاروت"
  ],
  [
      "id"=> 1,
    "name_ar"=> "تبوك"
  ],
  [
      "id"=> 1443,
    "name_ar"=> "تثليث"
  ],
  [
      "id"=> 2156,
    "name_ar"=> "تربه"
  ],
  [
      "id"=> 3712,
    "name_ar"=> "تنومة"
  ],
  [
      "id"=> 3737,
    "name_ar"=> "تيماء "
  ],
  [
      "id"=> 443,
    "name_ar"=> "ثادق"
  ],
  [
      "id"=> 1879,
    "name_ar"=> "ثول"
  ],
  [
      "id"=> 17,
    "name_ar"=> "جازان"
  ],
  [
      "id"=> 18,
    "name_ar"=> "جدة"
  ],
  [
      "id"=> 10,
    "name_ar"=> "حائل"
  ],
  [
      "id"=> 3718,
    "name_ar"=> "حريملاء"
  ],
  [
      "id"=> 47,
    "name_ar"=> "حفر الباطن"
  ],
  [
      "id"=> 3681,
    "name_ar"=> "حقل"
  ],
  [
      "id"=> 3161,
    "name_ar"=> "حوطة بني تميم"
  ],
  [
      "id"=> 3736,
    "name_ar"=> "حوطة سدير "
  ],
  [
      "id"=> 3725,
    "name_ar"=> "خليص"
  ],
  [
      "id"=> 62,
    "name_ar"=> "خميس مشيط"
  ],
  [
      "id"=> 288,
    "name_ar"=> "خيبر"
  ],
  [
      "id"=> 3704,
    "name_ar"=> "دخنة"
  ],
  [
      "id"=> 2268,
    "name_ar"=> "دومة الجندل"
  ],
  [
      "id"=> 2590,
    "name_ar"=> "رأس تنورة"
  ],
  [
      "id"=> 377,
    "name_ar"=> "رابغ"
  ],
  [
      "id"=> 3717,
    "name_ar"=> "رجال ألمع"
  ],
  [
      "id"=> 3709,
    "name_ar"=> "رفائع الجمش"
  ],
  [
      "id"=> 2256,
    "name_ar"=> "رفحاء"
  ],
  [
      "id"=> 3715,
    "name_ar"=> "رماح"
  ],
  [
      "id"=> 3714,
    "name_ar"=> "رنية"
  ],
  [
      "id"=> 2467,
    "name_ar"=> "رياض الخبراء"
  ],
  [
      "id"=> 3702,
    "name_ar"=> "زلوم"
  ],
  [
      "id"=> 3698,
    "name_ar"=> "ساجر"
  ],
  [
      "id"=> 3723,
    "name_ar"=> "سبت العلايه"
  ],
  [
      "id"=> 3673,
    "name_ar"=> "سراة  عبيد"
  ],
  [
      "id"=> 2237,
    "name_ar"=> "سكاكا"
  ],
  [
      "id"=> 454,
    "name_ar"=> "سيهات"
  ],
  [
      "id"=> 3347,
    "name_ar"=> "شرورة"
  ],
  [
      "id"=> 500,
    "name_ar"=> "شقراء"
  ],
  [
      "id"=> 3542,
    "name_ar"=> "صامطة"
  ],
  [
      "id"=> 3479,
    "name_ar"=> "صبيا"
  ],
  [
      "id"=> 2167,
    "name_ar"=> "صفوى"
  ],
  [
      "id"=> 1947,
    "name_ar"=> "ضبا"
  ],
  [
      "id"=> 3691,
    "name_ar"=> "ضرما"
  ],
  [
      "id"=> 3682,
    "name_ar"=> "ضرية"
  ],
  [
      "id"=> 3672,
    "name_ar"=> "ضمد"
  ],
  [
      "id"=> 3728,
    "name_ar"=> "طبرجل "
  ],
  [
      "id"=> 3716,
    "name_ar"=> "طريب"
  ],
  [
      "id"=> 2208,
    "name_ar"=> "طريف"
  ],
  [
      "id"=> 3726,
    "name_ar"=> "ظهران الجنوب"
  ],
  [
      "id"=> 2213,
    "name_ar"=> "عرعر"
  ],
  [
      "id"=> 3683,
    "name_ar"=> "عشيرة"
  ],
  [
      "id"=> 418,
    "name_ar"=> "عفيف"
  ],
  [
      "id"=> 3695,
    "name_ar"=> "عقلة الصقور"
  ],
  [
      "id"=> 2171,
    "name_ar"=> "عنك"
  ],
  [
      "id"=> 80,
    "name_ar"=> "عنيزة"
  ],
  [
      "id"=> 3692,
    "name_ar"=> "عيون الجواء"
  ],
  [
      "id"=> 3710,
    "name_ar"=> "قبة"
  ],
  [
      "id"=> 89,
    "name_ar"=> "قرية العليا"
  ],
  [
      "id"=> 3707,
    "name_ar"=> "قلوة"
  ],
  [
      "id"=> 3174,
    "name_ar"=> "ليلى"
  ],
  [
      "id"=> 1801,
    "name_ar"=> "محايل"
  ],
  [
      "id"=> 3666,
    "name_ar"=> "مدينة الملك عبدالله الاقتصادية"
  ],
  [
      "id"=> 3703,
    "name_ar"=> "مرات"
  ],
  [
      "id"=> 6,
    "name_ar"=> "مكة المكرمة"
  ],
  [
      "id"=> 3700,
    "name_ar"=> "مهد الدهب"
  ],
  [
      "id"=> 3417,
    "name_ar"=> "نجران"
  ],
  [
      "id"=> 3693,
    "name_ar"=> "وادي الدواسر "
  ],
  [
      "id"=> 3729,
    "name_ar"=> "وادي بن هشبل"
  ],
  [
      "id"=> 483,
    "name_ar"=> "ينبع"
  ]
];
